import telebot

TOKEN = '8642249181:AAExKWyRdESFDMr1Wk5CjSGDJbY4i9774Ds'
EXCEL_FILE = 'test_data.xlsx'
USERS_FILE = 'users.json'  # Пайдаланушы мәліметтері мен статистика
CHANNEL_ID = '@nurbaagai' # Өз каналыңыздың юзернеймін жазыңыз
CHANNEL_URL = 'https://t.me/nurbaagai' # Каналға сілтеме
ADMIN_ID = 1170639297  # Өзіңіздің Telegram ID-іңізді жазыңыз

bot = telebot.TeleBot(TOKEN)

# Мәзірлер құрылымы
CHAPTERS = {
    "7": ["Экожүйе", "Жүйелеу", "Жасушалық биология","Заттар тасымалы", "Қоректену", "Тыныс алу", "Бөліп шығару", "Қозғалыс", "Координация және реттелу", "Тұқымқуалаушылық", "Көбею. Өсу және даму", "Микробиология" ],
    "8": ["Жасушалық биология", "Молекулалық биология", "Көптүрлілік", "Қоректену", "Заттар тасымалы", "Тыныс алу", "Бөліп шығару", "Қозғалыс", "Координация ж/ә реттелу", "Көбею", "Өсу және даму", "Тұқымқуалаушылық", "Биосфера", "Қоршаған орта"],
    "9": ["Жасушалық биология", "Биосфера.Экожүйе", "Қоршаған орта", "Қоректену", "Заттар тасымалы", "Тыныс алу", "Бөліп шығару", "Координация және реттелу", "Қозғалыс", "Молекулалық биология", "Жасушалық биология", "Тұқымқуалаушылық", "Микробиология", "Көбею", "Өсу және даму", "Эволюциялық даму"],
    "10": ["Молекулалық биология", "Жасушалық биология", "Қоректену", "Заттар тасымалы", "Тыныс алу", "Бөліп шығару", "Жасушалық цикл", "Тұқымқуалаушылық", "Эволюциялық даму", "Координация және реттелу", "Қозғалыс", "Биомедицина", "Биотехнология"],
    "11": ["Молекулалық биология", "Қоректену", "Заттар тасымалы", "Координация және реттелу", "Көбею", "Өсу және даму", "Тұқымқуалаушылық", "Жасушалық биология", "Биотехнология", "Биомедицина", "Биосфера", "Экология"]
}

# Күйлерді сақтау
user_states = {} # Тест процесі
reg_states = {}  # Тіркелу процесі